Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
            ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);

            switch (currentButtonPressed) {
                case BUTTON_STATUS_UP:
                    if (currentIndex > 0) {
                        currentIndex--;
                    }
                    ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);
                    break;
                case BUTTON_STATUS_RIGHT:
                    pendingConfig.wifi.password = "";
                    newMenu                     = SELECCION_MENU_CONFIG_WIFI_PASSWORD;
                    break;
                case BUTTON_STATUS_DOWN:
                    if (currentIndex < (countNetworks - 1)) {
                        currentIndex++;
                    }
                    ESP8266Utils_getSsidAtIndex(currentIndex, pendingConfig.wifi.ssid);
                    break;
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_CONFIG_WIFI;
                    break;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_WIFI_PASSWORD: {
            static uint8_t previousButtonHolding = BUTTON_STATUS_NONE;

            unsigned long now = millis();

            if ((previousButtonHolding != currentButtonHolding)
                && (currentButtonHolding != BUTTON_STATUS_NONE)) {
                buttonHoldingTimeMs   = now;
                previousButtonHolding = currentButtonHolding;
            } else if (
                    (previousButtonHolding != currentButtonHolding)
                    && (currentButtonHolding == BUTTON_STATUS_NONE)) {
                if ((now - buttonHoldingTimeMs) >= LCD_HOLDING_TIME_CONFIRM_MS) {
                    if (previousButtonHolding == BUTTON_STATUS_DOWN) {
                        buzzer_sound_accept();
                        newMenu = SELECCION_MENU_CONFIG_WIFI_RESULTADO;
                        ESP8266Utils_connectToWifi(
                                pendingConfig.wifi.ssid,
                                pendingConfig.wifi.password);
                    }
                } else {
                    switch (previousButtonHolding) {
                        case BUTTON_STATUS_LEFT:
                            if (pendingConfig.wifi.password.length() == 0) {
                                newMenu = SELECCION_MENU_CONFIG_WIFI_SSID;
                            } else {
                                pendingConfig.wifi.password.remove(
                                        pendingConfig.wifi.password.length() - 1);
                            }
                            break;
                        case BUTTON_STATUS_UP:
                            if (pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]
                                < '~') {
                                pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]++;
                            }
                            break;
                        case BUTTON_STATUS_DOWN:
                            if (pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]
                                > '!') {
                                pendingConfig.wifi
                                        .password[pendingConfig.wifi.password.length() - 1]--;
                            }
                            break;
                        case BUTTON_STATUS_RIGHT:
                            pendingConfig.wifi.password += 'A';
                            break;
                    }
                }
                previousButtonHolding = currentButtonHolding;
            }
            break;
        }
        case SELECCION_MENU_CONFIG_WIFI_RESULTADO: {
            static bool wifiCredentialStored = false;
            if (ESP8266Utils_isWifiConnected()) {
                if (!wifiCredentialStored) {
                    wifiCredentialStored = true;
                    memcpy(settings.wifiSettings.ssid_sta,
                           pendingConfig.wifi.ssid.c_str(),
                           sizeof(settings.wifiSettings.ssid_sta));
                    memcpy(settings.wifiSettings.password_sta,
                           pendingConfig.wifi.password.c_str(),
                           sizeof(settings.wifiSettings.password_sta));
                    EEPROM_Schedule_Write(100);
                }
            } else {
                wifiCredentialStored = false;
            }
            switch (currentButtonPressed) {
                case BUTTON_STATUS_RIGHT:
                    if (ESP8266Utils_isWifiConnected()) {
                        buzzer_sound_accept();
                        newMenu = SELECCION_MENU_CONFIG_WIFI;
                    } else {
                        buzzer_sound_error();
                    }
                    break;
                case BUTTON_STATUS_LEFT:
                    newMenu = SELECCION_MENU_CONFIG_WIFI_PASSWORD;
                    break;
                case BUTTON_STATUS_DOWN:
                case BUTTON_STATUS_UP:
                    buzzer_sound_error();
                    break;
            }
            break;
        }
    }
    *currentMenu = newMenu;
}

void pantalla_actualizarReloj(String* lcdBuffer) {
    *lcdBuffer = "   ";
    time_t now;
    struct tm* timeinfo;
    now      = time(&now) + persistentVars_get_rtcTime().timezoneShift;
    timeinfo = localtime(&now);

    if ((timeinfo->tm_hour) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_hour);
    *lcdBuffer += String(':');

    if ((timeinfo->tm_min) < 10) {
        *lcdBuffer += String('0');
    }
    *lcdBuffer += String(timeinfo->tm_min);
    *lcdBuffer += String("   ");

    uint8_t _localLength = String((int)MyWeather.TemperatureDegree).length();
    // Limit degree to 2 digits
    if (_localLength < 4) {
        for (int i = 0; i < (3 - _localLength); i++) {
            *lcdBuffer += String(" ");
        }
        *lcdBuffer += String((int)MyWeather.TemperatureDegree);
        *lcdBuffer += (char)223;
        *lcdBuffer += String("C");
    } else {
        *lcdBuffer += String("     ");
    }

